-- phpMyAdmin SQL Dump
-- version phpStudy 2014
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2019 年 01 月 03 日 08:05
-- 服务器版本: 5.5.53
-- PHP 版本: 5.4.45

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `middleschoolwebsite`
--

-- --------------------------------------------------------

--
-- 表的结构 `newsinfoimage`
--

CREATE TABLE IF NOT EXISTS `newsinfoimage` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) DEFAULT NULL,
  `content` varchar(1200) DEFAULT NULL,
  `imagepath` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=37 ;

--
-- 转存表中的数据 `newsinfoimage`
--

INSERT INTO `newsinfoimage` (`Id`, `title`, `content`, `imagepath`) VALUES
(3, '666', '66666', '//picture//656647d6-23c0-45a9-93a0-fcd8296b7f67_5.jpg'),
(34, '33', '33', '//picture//51e5bded-c108-4b08-b406-b767ce1d15c2_test01.jpg'),
(35, '培训计划', '自主研发优能UMS教学管理系统:业内唯一获得政府官方认可的中学生在线学习系统。 实现学习内容 实现学习内容和教学策略与学生实际需求的阶段性匹配,及时检验并巩固学...', '//picture//9f45c5b0-de34-48ff-b266-76d7e447477f_test01.jpg'),
(36, '2019初中教育信息化工作计划', '以科学发展观为指导，依托我县“三通过程”等优势，通过不断培训教育信息化的技能，提高全县教师教育信息化应用水平，促进教育教学方法的改进，提高课堂教学效率，推动全县教育信息化均衡发展。\r\n\r\n　　XXXX年我校将以县教体局教育信息化工作计划为依托，结合我校各校实际，规范管理、强化培训、突出应用为重点，整体推进全校教育信息化基础设施建设，充分发挥教育信息网的作用，切实保障教育网站与网络信息安全，促进各校教育均衡发展，使全校教育技术装备工作迈上一个新台阶。', '//picture//25440e97-652a-4597-9fe7-904a0cb656af_flag.jpg'),
(33, '33', '33', '//picture//cd0a29c8-9c61-4816-9504-1c10bef41c96_test01.jpg'),
(32, '公告标题', '自主研发优能UMS教学管理系统:业内唯一获得政府官方认可的中学生在线学习系统。 实现学习内容 实现学习内容和教学策略与学生实际需自主研发优能UMS教学管理系统:业内唯一获得政府官方认可的中学生在线学习系统。 实现学习内容 实现学习内容和教学策略与学生实际需', '//picture//183618a2-410c-4b12-ac19-90b7c3ab6750_test01.jpg'),
(31, '中学教育', '中学教育是小学教育的继续和进入高等院校或转入其它中等学校的预备阶段;是暂时不能升学的初、高中学生准备就业的学习阶段。中学教育的对象是年龄在11、12岁--17、18岁之间的青少年，他们正处在生理、心理迅速发展和突变的转折时期，正经历着急剧获取知识和增长才干，以及世界观、人生观、价值观初步形成的关键年段。中学教育包括初中阶段和高中阶段两个层次的教育，中学教育对社会主义现代化建设中的物质文明建设和精神文明建设都起着至关重要的作用。', '//picture//d3b03d4f-a7b6-4a5e-9d0d-681b6dbccfed_zhao.jpg');

-- --------------------------------------------------------

--
-- 表的结构 `student_user`
--

CREATE TABLE IF NOT EXISTS `student_user` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `unique_id` varchar(255) NOT NULL DEFAULT '0',
  `name` varchar(255) NOT NULL DEFAULT '',
  `password` varchar(255) NOT NULL DEFAULT '',
  `sex` varchar(255) NOT NULL DEFAULT '',
  `idcard_number` varchar(255) NOT NULL DEFAULT '',
  `phonenumber` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`Id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=77 ;

--
-- 转存表中的数据 `student_user`
--

INSERT INTO `student_user` (`Id`, `unique_id`, `name`, `password`, `sex`, `idcard_number`, `phonenumber`) VALUES
(1, '101610234', '叶师图', '123', '0', '44082314002356', '14537233434'),
(2, '101601236', '张及时', '123456', '1', '45231642222554', '14537774556'),
(6, '101610234', '胡微凉', 'huweilaing66602', '1', '44082314002356', '145377743433'),
(7, '101610234', '豪华方', '123456', '1', '44082314002356', '1453777434'),
(8, '101610234', '陈技栏', '123456', '1', '44082314002356', '1453777434'),
(11, '101610234', '菜花', '123456', '0', '44082314002356', '12334534544'),
(64, '102354614', '耶果果', '123782', '0', '426892566478555', '12334534544'),
(14, '101610234', '黄书云', '123456', '1', '44082314002356', '145377743'),
(15, '101610234', '黄书云', '123456', '1', '44082314002356', '12334534544'),
(16, '101610234', '黄书方', '123456', '0', '44082314002356', ''),
(17, '101610234', '黄书云', '123456', '1', '44082314002356', ''),
(18, '101610234', '黄云', '123456', '0', '44082314002356', ''),
(20, '101610234', '黄书云', '123456', '1', '44082314002356', '145377743'),
(21, '101610234', '荷书云', '123456', '1', '44082314002356', '12334534544'),
(22, '101610234', '黄书云', '123456', '1', '44082314002356', ''),
(23, '101610234', '黄书云', '123456', '1', '44082314002356', ''),
(24, '101610234', '黄书云', '123456', '1', '44082314002356', '145377743'),
(25, '101610234', '黄书云', '123456', '1', '44082314002356', ''),
(26, '101610234', '荷芳芳', '123456', '0', '44082314002356', ''),
(27, '101610234', '黄书云', '123456', '1', '44082314002356', ''),
(28, '101610234', '黄书云', '123456', '1', '44082314002356', '145377743'),
(29, '101610234', '黄书云', '123456', '1', '44082314002356', ''),
(30, '101610234', '小芳', '123456', '0', '44082314002356', ''),
(31, '101610234', '黄书云', '123456', '1', '44082314002356', ''),
(32, '101610234', '黄书云', '123456', '1', '44082314002356', ''),
(33, '101610234', '黄书云', '123456', '1', '44082314002356', ''),
(34, '101610234', '黄书云', '123456', '1', '44082314002356', '145377743'),
(35, '101610234', '黄书云', '123456', '1', '44082314002356', ''),
(36, '101610234', '黄书云', '123456', '1', '44082314002356', ''),
(37, '101610234', '黄书云', '123456', '1', '44082314002356', '145377743'),
(38, '101610234', '荷藕技', '123456', '1', '44082314002356', ''),
(39, '101610234', '黄书云云云66666', '123456', '0', '44082314002356', '1344444444444444444444'),
(40, '101610234', '黄书云', '123456', '1', '44082314002356', ''),
(41, '101610234', '黄书云', '123456', '1', '44082314002356', ''),
(66, '2', '2', '2', '1', '2', '2'),
(43, '   <c:when ', '', '', '', '', ''),
(70, '1234685', '好贵方', '123564265', '0', '15562257568577', '1161354862'),
(45, '  </c:when>', '', '', '', '', ''),
(46, '0', '', '', '', '', '145377743'),
(65, '2', '2', '2', '0', '2', '2'),
(49, '  </c:when>', '', '', '', '', ''),
(50, '101610234', '陈技栏', '123456', '1', '44082314002356', ''),
(51, '101610234', '陈技栏', '123456', '1', '44082314002356', ''),
(52, '101610234', '陈技栏', '123456', '1', '44082314002356', '145377743'),
(53, '101610234', '陈技栏', '123456', '1', '44082314002356', ''),
(54, '101610234', '陈技栏', '123456', '1', '44082314002356', ''),
(55, '101610234', '陈技栏', '123456', '1', '44082314002356', ''),
(56, '101610234', '陈技栏', '123456', '1', '44082314002356', '145377743'),
(57, '101610234', '陈技栏', '123456', '1', '44082314002356', ''),
(58, '101610234', '陈技栏', '123456', '1', '44082314002356', '145377743'),
(59, '', '2', '', '1', '2', ''),
(60, '102543222', '赵康展', '123456', '1', '14286655662482', ''),
(61, '444', '444', '444', '1', '444', '444'),
(67, '2', '2', '2', '1', '2', '2'),
(68, '2', '22', '2', '1', '2', '2'),
(69, '16124100234', '赵康展', '123456', '1', '44035618850254265', '13432819958'),
(71, '222', '16124100133', '123456', '1', '22', ''),
(72, '李如云', '李如云', '123456', '1', '4408231666542023', '178165423355'),
(73, '16124100234', '张三', '123456', '1', '44236216682564', '1234467785423'),
(74, '1655534256', '李云四', '123456', '0', '44235166652548', '14325123154'),
(75, '14356855', '赵云四', '123456', '1', '16432813332658', '16243219958'),
(76, '166666666666', '166666666666', '166666666666', '0', '16666666666655', '166666666666444444');

-- --------------------------------------------------------

--
-- 表的结构 `teacher_user`
--

CREATE TABLE IF NOT EXISTS `teacher_user` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `unique_id` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `sex` varchar(255) DEFAULT NULL,
  `idcard_number` varchar(255) DEFAULT NULL,
  `phonenumber` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=24 ;

--
-- 转存表中的数据 `teacher_user`
--

INSERT INTO `teacher_user` (`Id`, `unique_id`, `name`, `password`, `sex`, `idcard_number`, `phonenumber`) VALUES
(1, '165555', 'adimn', '1123456', '1', '565213588963', '1456213588'),
(2, '102345', '陈云', '125356', '1', '456213588963', '1568795522'),
(3, '165546', 'adimn', '11286', '0', '354668899225', '1568795522'),
(4, '165547', 'adimn', '11556', '1', '354660199225', '1568795522'),
(5, '165548', 'adimn', '1123456', '1', '456213588963', '134625892'),
(6, '165549', 'adimn', '1123456', '0', '1354668899225', '1568795522'),
(7, '165550', 'adimn', '1356', '1', '354667009225', '158962355'),
(8, '165551', 'adimn', '1123456', '1', '354668899225', '134325689'),
(9, '165552', 'adimn', '112456', '0', '1354199225', '1568795522'),
(10, '165553', 'adimn', '1123456', '0', '452322222945', '1568795522'),
(11, '165554', 'adimn', '1100056', '1', NULL, '1568795522'),
(12, '165557', 'adimn', '112056', '0', '354668899225', '1568795522'),
(13, '165558', 'adimn', '112056', '1', '254668899225', '158962355'),
(14, '165557', 'adimn', '112056', '0', '354668899225', '1568795522'),
(15, '165557', 'adimn', '112056', '0', '354668899225', '1568795522'),
(16, '165557', 'adimn', '112056', '0', '354668899225', '1568795522'),
(17, '165557', 'adimn', '112056', '0', '354668899225', '1568795522'),
(18, '165548', 'adimn', '1123456', '1', '456213588963', '134625892'),
(19, '165548', 'adimn', '1123456', '1', '456213588963', '134625892'),
(20, '165548', 'adimn', '1123456', '1', '456213588963', '134625892'),
(21, '165548', 'adimn', '1123456', '1', '456213588963', '134625892'),
(22, '165548', 'adimn', '1123456', '1', '456213588963', '134625892'),
(23, '165548', 'adimn', '1123456', '1', '456213588963', '134625892');

-- --------------------------------------------------------

--
-- 表的结构 `test`
--

CREATE TABLE IF NOT EXISTS `test` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `question` varchar(255) DEFAULT NULL,
  `select_a` varchar(255) DEFAULT NULL,
  `select_b` varchar(255) DEFAULT NULL,
  `select_c` varchar(255) DEFAULT NULL,
  `select_d` varchar(255) DEFAULT NULL,
  `anser` varchar(255) DEFAULT NULL,
  `explain` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT AUTO_INCREMENT=14 ;

--
-- 转存表中的数据 `test`
--

INSERT INTO `test` (`Id`, `question`, `select_a`, `select_b`, `select_c`, `select_d`, `anser`, `explain`) VALUES
(1, '下列是小明使用天平的几点做法，其中正确的是（）', '测量前将天平放在水平桌面上\r\n测量前将天平放在水平桌面上\r\n', '调节横梁平衡时，游码可不在零刻度处\r\n', '用手直接加减砝码\r\n', '所测物体质量可以超过天平最大测量值\r\n', 'A', '本题考查托盘天平的使用。在测量时，天平放在水平工作台上，A对；\r\n调节横梁平衡时，游码移至标尺零刻度线处后再旋动平衡螺母调节天平平衡，B错；\r\n在加减砝码时，需用镊子，不可用手，C错；\r\n所测物体质量不可以超过天平最大测量值，D错。\r\n'),
(2, '下列措施中能使蒸发变快的是（）', '用电吹风机吹头发', '给墨水瓶加盖', '用地膜覆盖农田', '把新鲜的苹果装入塑料袋 ', 'A', '略'),
(3, '下列现象中，通过热传递改变物体内能的是（）', '打开啤酒瓶盖，瓶口处气体温度降低', '放进冰箱冷冻室的水变成冰块', '用锯锯木头，锯条发热', '用锯条锯木头，锯条发热', 'C', '略'),
(4, '晚上,在桌面上铺一张白纸,把一块小平面镜压在白纸上,让手电筒的光正对着平面镜和白纸照射,人观察平面镜和白纸看到的现象是（）', '平面镜比较亮', '可能是白纸亮,也可能是平面镜亮', '白纸比较亮', '以上说法都不对', 'B', '略'),
(5, '雨后的晚上，天刚放晴，地面虽已干，但仍留有不少积水，为了不致踩到地上的积水，下面正确的是（）', '迎着月光走地上发亮处是积水，背着月光走地上暗处是积水', '迎着月光走地上暗处是积水，背着月光走地上发亮处是积水', '迎着月光或背着月光走，都是地上发亮处是积水', '迎着月交或背着月光走，都是地上暗处是积水人站在竖直放', 'C', '略'),
(6, '用托盘天平测物体的质量前，调节横梁平衡时，发现指针指在分度盘中线的左侧，这时应该（）', '将游码向左移动\r\n', '将右端平衡螺母向左旋进一些\r\n', '将游码向右移动\r\n', '将右端平衡螺母向右旋出一些\r\n', 'D', '本题考查托盘天平的调节。调节天平横梁\r\n平衡的过程中，不能调节游码的位置；\r\n指针偏向分度盘的左侧，横\r\n梁左边的质量大，应该向右调节平衡螺母。\r\n'),
(7, '为了测一瓶油的质量，某同学采用了如下步骤错误的是（）', '将游码置于左端零位置。\r\n', '瓶放左盘，称得瓶的质量；\r\n', '移动平衡螺母使横梁平衡', '瓶放右盘，称得瓶的质量', 'D', '本题考查测液体质量的方法。使用天\r\n平称量液体的质量时，为使测量结果准确，\r\n一般先称量容器的质量再称量液体和容器的\r\n总质量，用液体和容器的总质量减去容器的\r\n质量就得液体的质量。\r\n'),
(8, '用托盘天平测物体的质量前，调节横梁平衡时，发现指针指在分度盘中线的左侧，这时应该（）', '将游码向左移动\r\n', '将右端平衡螺母向左旋进一些\r\n', '将游码向右移动\r\n', '将右端平衡螺母向右旋出一些\r\n', 'D', '本题考查托盘天平的调节。调节天平横梁\r\n平衡的过程中，不能调节游码的位置；\r\n指针偏向分度盘的左侧，横\r\n梁左边的质量大，应该向右调节平衡螺母。\r\n'),
(9, '为了测一瓶油的质量，某同学采用了如下步骤错误的是（）', '将游码置于左端零位置。\r\n', '瓶放左盘，称得瓶的质量；\r\n', '移动平衡螺母使横梁平衡', '瓶放右盘，称得瓶的质量', 'D', '本题考查测液体质量的方法。使用天\r\n平称量液体的质量时，为使测量结果准确，\r\n一般先称量容器的质量再称量液体和容器的\r\n总质量，用液体和容器的总质量减去容器的\r\n质量就得液体的质量。\r\n'),
(10, '下列现象中，通过热传递改变物体内能的是（）', '打开啤酒瓶盖，瓶口处气体温度降低', '放进冰箱冷冻室的水变成冰块', '用锯锯木头，锯条发热', '用锯条锯木头，锯条发热', 'C', '略'),
(11, '晚上,在桌面上铺一张白纸,把一块小平面镜压在白纸上,让手电筒的光正对着平面镜和白纸照射,人观察平面镜和白纸看到的现象是（）', '平面镜比较亮', '可能是白纸亮,也可能是平面镜亮', '白纸比较亮', '以上说法都不对', 'B', '略'),
(12, '下列现象中，通过热传递改变物体内能的是（）', '打开啤酒瓶盖，瓶口处气体温度降低', '放进冰箱冷冻室的水变成冰块', '用锯锯木头，锯条发热', '用锯条锯木头，锯条发热', 'C', '略'),
(13, '晚上,在桌面上铺一张白纸,把一块小平面镜压在白纸上,让手电筒的光正对着平面镜和白纸照射,人观察平面镜和白纸看到的现象是（）', '平面镜比较亮', '可能是白纸亮,也可能是平面镜亮', '白纸比较亮', '以上说法都不对', 'B', '略');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
